Билет16/Reports/Перерасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>Перерасчеты</Name>
		</Properties>
	</Report>
</MetaDataObject>

Билет16/CalculationRegisters/ДополнительныеНачисления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<CalculationRegister>
		<Properties>
			<Name>ДополнительныеНачисления</Name>
			<Periodicity>Month</Periodicity>
			<ActionPeriod>false</ActionPeriod>
			<BasePeriod>true</BasePeriod>
			<ChartOfCalculationTypes>ChartOfCalculationTypes.ДополнительныеНачисления</ChartOfCalculationTypes>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Параметр1</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметр3</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<BaseDimension>false</BaseDimension>
				</Properties>
			</Dimension>
		</ChildObjects>
	</CalculationRegister>
</MetaDataObject>

Билет16/Reports/Перерасчеты/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПересчитатьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПоСотрудникуИПодразделению.ОбъектПерерасчета КАК ОбъектПерерасчета,
	|	ПоСотрудникуИПодразделению.Сотрудник КАК Сотрудник,
	|	ПоСотрудникуИПодразделению.Подразделение КАК Подразделение
	|ИЗ
	|	РегистрРасчета.ДополнительныеНачисления.ПоСотрудникуИПодразделению КАК ПоСотрудникуИПодразделению
	|ИТОГИ ПО
	|	ОбъектПерерасчета";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбъектПерерасчета = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОбъектПерерасчета.Следующий() Цикл
		
		ДокументКПерерасчету = ВыборкаОбъектПерерасчета.ОбъектПерерасчета;
		
		ВыборкаДетальныеЗаписи = ВыборкаОбъектПерерасчета.Выбрать();
		
		ДопОтбор = Новый Структура("Сотрудники, Подразделения", Новый Массив, Новый Массив);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			ДопОтбор.Сотрудники.Добавить(ВыборкаДетальныеЗаписи.Сотрудник);
			ДопОтбор.Подразделения.Добавить(ВыборкаДетальныеЗаписи.Подразделение);
			
		КонецЦикла;
		
		ДополнительныеНачисления = РегистрыРасчета.ДополнительныеНачисления.СоздатьНаборЗаписей();
		ДополнительныеНачисления.Отбор.Регистратор.Установить(ДокументКПерерасчету);
		ДополнительныеНачисления.Прочитать();
		
		Расчет.РассчитатьКомпенсацию(ДокументКПерерасчету, ДополнительныеНачисления, ДопОтбор);
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура Пересчитать(Команда)
	ПересчитатьНаСервере();
	СкомпоноватьРезультат();
КонецПроцедуры
